import "./page.css";

export default function Accessibility() {
  return (
    <div className="accessibility-page">
      <div className="content">
        <h1>הצהרת נגישות</h1>
        <p>
          בהצהרה זו מטרתנו לייעל את השימוש ולשפר את השירות שלנו בכל הנוגע
          לנגישות ושוויון זכויות לאנשים בעלי מוגבלויות. התאמת הנגישות שלנו בוצעה
          בהתאם לתקנה 35 בתקנות שוויון זכויות לאנשים עם מוגבלות (התאמות נגישות
          לשירות) התשע"ג 2013 לרמה AA בכפוף לשינויים והתאמות שבוצעו במסמך התקן
          הישראלי. התאמת הנגישות נבדקה בדפדפנים כרום, פיירפוקס, ספארי, מוזילה
          ואדג'.
        </p>

        <h2>אמצעי נגישות הקיימים באתר:</h2>
        <ul>
          <li>
            תמיכה בכל הדפדפנים התקניים המקובלים (כמו Chrome, Edge, FireFox,
            Opera, Mozila).
          </li>
          <li>תכני האתר נכתבו בשפה ברורה ונעשה שימוש בפונטים קריאים</li>
          <li>מבניות האתר בנויה מכותרות, פסקאות ורשימות</li>
          <li>התמצאות באתר היא פשוטה ונוחה וכוללת תפריטים זמינים וברורים</li>
          <li>הקישורים באתר ברורים ומסבירים להיכן מועברים לאחר לחיצה עליהם</li>
          <li>קישורים בתחילת הדף המאפשרים דילוג לתוכן</li>
          <li>תיאור טקסטואלי לתמונות ואייקונים עבור טכנולוגיות מסייעות</li>
          <li>התאמת האתר לסביבות עבודה ברזולוציות שונות (רספונסיביות)</li>
          <li>כפתורי עצירה והפעלה של גלריות סרטונים</li>
          <li>
            הוטמעו חוקי ARIA העוזרים לפרש את תוכן האתר בצורה מדויקת וטובה יותר
          </li>
          <li>
            הנגשת תפריטים, טפסים ושדות, היררכיית כותרות, רכיבי טאבים, חלונות
            קופצים ועוד
          </li>
        </ul>

        <h2>שינוי תצוגה באתר</h2>
        <ul>
          <li>
            ניתן להגדיל או להקטין את תצוגת האתר באמצעות לחיצה על אחד מכפתורי ה-
            "CTRL" ביחד עם גלגלת העכבר או ביחד עם הסימן "+" עבור הגדלה או ביחד
            עם הסימן "-" עבור הקטנת התצוגה. כל לחיצה תקטין או תגדיל את המסך
            בעשרה אחוזים (10%)
          </li>
          <li>
            שינוי גודל הגופן ייעשה באמצעות שימוש בתפריט הנגישות המצוי באתר
          </li>
          <li>
            גולשים אשר אין ברשותן עכבר או שאינן יכולים לעשות שימוש בעכבר יכולים
            להפעיל את התכונות המצויות באתר על ידי לחיצה על המקש "TAB". כל לחיצה
            תעביר את הסמן אל האפשרות הבאה באתר לחיצה על מקש ה- "Enter" תפעיל את
            הקישור עליו נמצא הסמן
          </li>
          <li>
            האתר אינו כולל הבהובים, ריצודים ותכנים בתנועה. במקומות אשר נמצאים
            תכנים כאלה, ניתן לעצור אותם בעמידה עליהם ולחיצה על העכבר או מעבר
            אליהם על ידי מקש ה- "TAB" ולחיצה על מקש ה- "Enter"
          </li>
        </ul>

        <h2>התאמת אתר למוגבלי ראייה ושמיעה</h2>
        <ul>
          <li>מגדילי ראות (רזולוציה) בסיסיים</li>
          <li>תוכנות זיהוי קולי</li>
          <li>חבילות זיהוי קולי של מערכות ההפעלה</li>
        </ul>

        <h2>סייגים לנגישות</h2>
        <p>
          הנהלת האתר עושה ככל שניתן על מנת לוודא כי כלל הדפים המוצגים יהיו
          מונגשים. יחד עם זאת, יתכן וישנם דפים שטרם הונגשו, או שטרם נמצא פתרון
          טכנולוגי מתאים לצורך הנגשתם. בנוסף, ייתכן ובמודעות חיצוניות, אשר
          הוכנסו על ידי בעלי עסקים המפרסמים באתר, ההנגשה לא תהיה שלמה או מספקת.
        </p>

        <h2>נתקלתם בבעיה? צרו קשר:</h2>
        <p>אימייל: max.bakehila@gmail.com</p>
      </div>
    </div>
  );
}
